---
kind: property
id: P:Autodesk.Revit.DB.Events.ProgressChangedEventArgs.LowerRange
source: html/fd02b552-e0f0-84a1-229f-0c9b6b1cc4f8.htm
---
# Autodesk.Revit.DB.Events.ProgressChangedEventArgs.LowerRange Property

Lower part of progress bar range - always zero

## Syntax (C#)
```csharp
public int LowerRange { get; }
```